app/controllers/chirps_controller.rb

SELECT "chirps".* FROM "chirps"
---
  def index
    @chirps = Chirp.all.sort_by { |chirp| chirp.score }

INSERT INTO "chirps" ("message", "created_at", "updated_at") VALUES (?, ?, ?)  [["message", "banamnana"], ["created_at", "2021-03-02 23:15:57.004403"], ["updated_at", "2021-03-02 23:15:57.004403"]]
---
  def create
    chirp = Chirp.new(chirp_params)

    if chirp.save