app/controllers/upvotes_controller.rb

SELECT  "chirps".* FROM "chirps" WHERE "chirps"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
INSERT INTO "upvotes" ("chirp_id", "ip", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["chirp_id", 16], ["ip", "::1"], ["created_at", "2021-03-02 23:45:38.395418"], ["updated_at", "2021-03-02 23:45:38.395418"]]
SELECT  "upvotes".* FROM "upvotes" WHERE "upvotes"."chirp_id" = ? AND "upvotes"."ip" = ? LIMIT ?  [["chirp_id", 16], ["ip", "::1"], ["LIMIT", 1]]
---
  def upvote_chirp
    chirp = Chirp.find(params[:chirp_id])
    upvote = Upvote.find_or_create_by(chirp: chirp, ip: request.remote_ip)

SELECT  "chirps".* FROM "chirps" WHERE "chirps"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT  "upvotes".* FROM "upvotes" WHERE "upvotes"."chirp_id" = ? AND "upvotes"."ip" = ? LIMIT ?  [["chirp_id", 16], ["ip", "::1"], ["LIMIT", 1]]
DELETE FROM "upvotes" WHERE "upvotes"."id" = ?  [["id", 3]]
---
  def remove_upvote
    chirp = Chirp.find(params[:chirp_id])
    upvote = Upvote.find_by(chirp: chirp, ip: request.remote_ip)
    upvote.delete