app/models/chirp.rb

SELECT  "upvotes".* FROM "upvotes" WHERE "upvotes"."chirp_id" = ? AND "upvotes"."ip" = ? LIMIT ?  [["chirp_id", 16], ["ip", "::1"], ["LIMIT", 1]]
---
  def already_upvoted?(ip)
    Upvote.find_by(chirp: self, ip: ip).present?

SELECT  "chirps".* FROM "chirps" ORDER BY "chirps"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def score
    ranking = Chirp.last.id - id